demo/FSIBeam_interFSIFoam_2206/sub-iter_5/runData/fluidDomain/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0; 
    }
    outlet
    {
        type            calculated;
        value           uniform 0; 
    }
    top
    {
        type            calculated;
        value           uniform 0; 
    }
    bottom
    {
        type            calculated;
        value           uniform 0; 
    }
    left
    {
        type            calculated;
        value           uniform 0; 
    }
    symmetry
    {
        type            symmetryPlane;
    }
    interface
    {
        type            calculated;
        value           uniform 0; 
    }
}


// ************************************************************************* //
